app/controllers/movies_controller.rb

  def search_director_movies
    @movie = Movie.find(params[:related])

    if @movie.director.length > 0 then
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]